snackytime/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    # @snack = Snack.find(params[:snack_id])
    @comments = Comment.all