snackytime/app/controllers/snacks_controller.rb

  def index
    @snack = Snack.all
---
SELECT "snacks".* FROM "snacks"

  def show
    @snack = Snack.find(params[:id])
---
SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = $1 LIMIT 1  [["id", 3]]

  def create
    @snack = Snack.create(snack_params)
---
INSERT INTO "snacks" ("name", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "bsjak"], ["country", "c asm,"], ["created_at", "2016-04-07 23:17:03.758556"], ["updated_at", "2016-04-07 23:17:03.758556"]]